glcloud/keil_v5/ARM/PACK/.Web/NXP.MK11DA5_DFP.pdsc
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MK11DA5_driver.uart">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK11DA5_driver.dspi_driver.edma">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK11DA5_driver.edma_driver.i2c">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="device.MK11DA5_driver.edma_driver.uart">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK11DA5_device.device_device_driver.edma">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK11DA5_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK11DA5_driver.common_driver.dmamux">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MK11DA5_driver.common">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK11DA5_driver.flash">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
    <condition id="device.MK11DA5">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="devices.MK11DA5_platform.Include_core_cm4">
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
    </condition>
    <condition id="devices.MK11DN512Axxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
    </condition>
    <condition id="devices.MK11DX128Axxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
    </condition>
    <condition id="devices.MK11DX256Axxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
    </condition>
    <condition id="devices.MK11DN512Axxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK11DN512A???5"/>
    </condition>
    <condition id="devices.MK11DX128Axxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128A???5"/>
    </condition>
    <condition id="devices.MK11DX256Axxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256A???5"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
